Frederic98/MacroBoard/hardware/MyBoards/avr/boards.txt
menu.cpu=Processor

macroboard.name=MacroBoard
macroboard.vid.0=0x2341
macroboard.pid.0=0x0036

macroboard.upload.tool=avrdude
macroboard.upload.protocol=avr109
macroboard.upload.maximum_size=28672
macroboard.upload.maximum_data_size=2560
macroboard.upload.speed=57600
macroboard.upload.disable_flushing=true
macroboard.upload.use_1200bps_touch=true
macroboard.upload.wait_for_upload_port=true

macroboard.bootloader.low_fuses=0xff
macroboard.bootloader.high_fuses=0xd8
macroboard.bootloader.extended_fuses=0xcb
macroboard.bootloader.path=arduino:caterina
macroboard.bootloader.file=Caterina-Leonardo.hex
macroboard.bootloader.unlock_bits=0x3F
macroboard.bootloader.lock_bits=0x2F

macroboard.build.mcu=atmega32u4
macroboard.build.f_cpu=16000000L
macroboard.build.board=AVR_LEONARDO
macroboard.build.usb_product="MacroBoard"
macroboard.build.vid=0x2341
macroboard.build.pid=0x8036
macroboard.build.core=arduino:arduino
macroboard.build.variant=macroboard
macroboard.build.extra_flags={build.usb_flags}